Wedge_Throttle_LES/constant/HighPthermoProps
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          thermodynamicProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//                    kg  m  s  +  +  +  +


theta_0      theta_0 [ 0  0  1  0  0  0  0] 3.84E-7;

alphaFracExp        alphaFracExp [ 0  0  0  0  0  0  0] -0.54;

pNonDimExp      pNonDimExp [ 0  0  0  0  0  0  0] -1.76;


aL              aL   [ 0  1 -1  0  0  0  0] 1.0e15;  // 1200.0;

aV              aV   [ 0  1 -1  0  0  0  0] 1.0E15;  // 300.0;


theta_floor 
                  theta_floor [0   0  1  0  0  0  0] 1.0E-11;

rhoMin            rhoMin [ 1 -3  0  0  0  0  0] 0.01;

thermModel  refprop;
lBoundRho  no;

pcritical   yes;
adiabatic   yes;

compressible no;
// ************************************************************************* //
